---
kind: method
id: M:Autodesk.Revit.DB.LinkLoadResult.#ctor
source: html/8b98cab7-1b1d-0324-3f63-0faa7674e4c7.htm
---
# Autodesk.Revit.DB.LinkLoadResult.#ctor Method

Constructs a new uninitialized LinkLoadResult object.

## Syntax (C#)
```csharp
public LinkLoadResult()
```